; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   grey_door_1 - door
   yellow_ball_1 blue_ball_2 - ball
   empty - empty_0
   room_2 room_1 - room
   grey_box_2 - box
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (and (locked grey_door_1) (not (or (= ?obj yellow_ball_1) (not (emptyhands))))) (not (hold_1))) (when (or (= ?obj yellow_ball_1) (not (emptyhands))) (hold_1)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (and (locked grey_door_1) (emptyhands)) (not (hold_1))) (when (not (emptyhands)) (hold_1)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (and (locked grey_door_1) (emptyhands)) (not (hold_1))) (when (not (emptyhands)) (hold_1)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)) (not (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1))))))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (and (locked grey_door_1) (emptyhands)) (not (hold_1))) (when (not (emptyhands)) (hold_1)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_1) (when (and (or (= ?obj blue_ball_2) (carrying blue_ball_2)) (objectinroom grey_box_2 room_2) (not (and (= ?obj grey_box_2) (= ?room room_2)))) (hold_2)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (and (locked grey_door_1) (not (or (= ?obj yellow_ball_1) (at_ yellow_ball_1)))) (not (hold_1))) (when (or (= ?obj yellow_ball_1) (at_ yellow_ball_1)) (hold_1)) (when (and (carrying blue_ball_2) (not (= ?obj blue_ball_2)) (or (and (= ?obj grey_box_2) (= ?room room_2)) (objectinroom grey_box_2 room_2))) (hold_2)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1))))) (hold_0)) (when (and (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1))))) (not (or (at_ yellow_ball_1) (not (emptyhands))))) (not (hold_1))) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 purple_door_2 green_door_1 - door
   purple_ball_1 blue_ball_1 grey_ball_1 - ball
   yellow_box_1 grey_box_1 - box
 )
 (:init (agentinroom room_2) (objectinroom grey_box_1 room_1) (objectinroom yellow_ball_1 room_1) (objectinroom blue_ball_1 room_1) (objectinroom purple_ball_1 room_2) (objectinroom blue_ball_2 room_3) (objectinroom grey_ball_1 room_4) (objectinroom yellow_box_1 room_4) (objectinroom grey_box_2 room_4) (objectcolor grey_box_1 greytype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_ball_1 bluetype) (objectcolor purple_ball_1 purpletype) (objectcolor blue_ball_2 bluetype) (objectcolor grey_ball_1 greytype) (objectcolor yellow_box_1 yellowtype) (objectcolor grey_box_2 greytype) (objectcolor purple_door_1 purpletype) (objectcolor grey_door_1 greytype) (objectcolor purple_door_2 purpletype) (objectcolor green_door_1 greentype) (emptyhands) (locked purple_door_1) (locked grey_door_1) (locked purple_door_2) (locked green_door_1) (adjacentrooms room_2 room_1 purple_door_1) (adjacentrooms room_1 room_2 purple_door_1) (adjacentrooms room_3 room_1 grey_door_1) (adjacentrooms room_1 room_3 grey_door_1) (adjacentrooms room_4 room_2 purple_door_2) (adjacentrooms room_2 room_4 purple_door_2) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_2) (hold_0) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d greytype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor purple_door_2 room_2 room_4)
   added: (at_ purple_door_2)
   goals met: 1 of 4
2. (toggle purple_door_2)
   deleted: (locked purple_door_2)
   goals met: 1 of 4
3. (gotoroom room_2 room_4 purple_door_2)
   deleted: (agentinroom room_2) (at_ purple_door_2)
   added: (agentinroom room_4) (visited room_4)
   goals met: 1 of 4
4. (gotodoor green_door_1 room_4 room_3)
   added: (at_ green_door_1)
   goals met: 1 of 4
5. (toggle green_door_1)
   deleted: (locked green_door_1)
   goals met: 1 of 4
6. (gotoobject grey_box_2 room_4)
   deleted: (at_ green_door_1)
   added: (at_ grey_box_2)
   goals met: 1 of 4
7. (pick grey_box_2 room_4)
   deleted: (at_ grey_box_2) (emptyhands) (objectinroom grey_box_2 room_4)
   added: (carrying grey_box_2) (hold_1)
   goals met: 2 of 4
8. (gotoroom room_4 room_2 purple_door_2)
   deleted: (agentinroom room_4)
   added: (agentinroom room_2)
   goals met: 2 of 4
9. (gotoempty)
   added: (at_ empty)
   goals met: 2 of 4
10. (drop grey_box_2 room_2)
   deleted: (carrying grey_box_2) (at_ empty) (hold_1)
   added: (at_ grey_box_2) (emptyhands) (objectinroom grey_box_2 room_2)
   goals met: 1 of 4
11. (gotoroom room_2 room_4 purple_door_2)
   deleted: (agentinroom room_2) (at_ grey_box_2)
   added: (agentinroom room_4)
   goals met: 1 of 4
12. (gotoroom room_4 room_3 green_door_1)
   deleted: (agentinroom room_4)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 4
13. (gotoobject blue_ball_2 room_3)
   added: (at_ blue_ball_2)
   goals met: 1 of 4
14. (pick blue_ball_2 room_3)
   deleted: (at_ blue_ball_2) (emptyhands) (objectinroom blue_ball_2 room_3)
   added: (carrying blue_ball_2) (hold_1) (hold_2)
   goals met: 3 of 4
15. (gotodoor grey_door_1 room_3 room_1)
   added: (at_ grey_door_1)
   goals met: 3 of 4
16. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 4 of 4
